In [20]:
 import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Fare','Cabin','Embarked'],axis='columns',inplace = True)
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [22]:
target = df.Survived
inputs = df.drop('Survived',axis = 'columns')

In [23]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [24]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age  female  male
0       3    male  22.0       0     1
1       1  female  38.0       1     0
2       3  female  26.0       1     0

In [25]:
inputs.drop('Sex',axis='columns',inplace = True)
inputs.head(3)

   Pclass   Age  female  male
0       3  22.0       0     1
1       1  38.0       1     0
2       3  26.0       1     0

In [26]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [27]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [28]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

   Pclass   Age  female  male
0       3  22.0       0     1
1       1  38.0       1     0
2       3  26.0       1     0
3       1  35.0       1     0
4       3  35.0       0     1

In [29]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.3)

In [30]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [31]:
model.fit(x_train,y_train)

GaussianNB()

In [32]:
model.score(x_test,y_test)

0.7723880597014925

In [33]:
x_test[:10]

     Pclass        Age  female  male
563       3  29.699118       0     1
105       3  28.000000       0     1
272       2  41.000000       1     0
574       3  16.000000       0     1
513       1  54.000000       1     0
678       3  43.000000       1     0
71        3  16.000000       1     0
710       1  24.000000       1     0
111       3  14.500000       1     0
334       1  29.699118       1     0

In [34]:
y_test[:10]

563    0
105    0
272    1
574    0
513    1
678    0
71     0
710    1
111    0
334    1
Name: Survived, dtype: int64